#+options: ^:nil toc:nil

* org
#+begin_src elisp
(org-export-define-derived-backend 'stasis-md 'md
  :translate-alist
  '((template . stasis-md-template)))

(defun stasis-md-template (contents info)
  (concat
   (format "Title: %s\n" (car (plist-get info :title)))
   (format "Date: %s\n" (car (plist-get info :date)))
   "\n\n"
   contents))

(defun my/stasis-export ()
  "Export each top-level heading of the current Org file to its own file."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "^\\* " nil t) ;; Match top-level headings
      (org-narrow-to-subtree)
      (let* ((file (org-export-output-file-name ".md" 'subtree))
             (dir (and file (file-name-directory file))))
        (when file
          (message "Exporting %s..." file)
          (when (and dir (not (file-directory-p dir)))
            (make-directory dir 'parents))
          (org-export-to-file 'stasis-md file nil 'subtree)))
      (widen))))
#+end_src

#+RESULTS:
:results:
my/stasis-export
:end:

* Hello Stasis
:properties:
:export_title: Hello Stasis
:export_file_name: generated/contents/blog/2024/5a7fcc.md
:export_date: 2024-12-21
:end:

私は conao3.com を持っていて、どうせ何回ブログを作っても飽きるので初めからサブドメインで用意するようにしています。
今までのブログはこんな感じ。

- https://conao3.com :: 2020/05~ hugo製
- https://a.conao3.com :: 2023/03~ astro製
- https://s.conao3.com :: 2024/12~ stasis製

このブログは[[https://github.com/magnars/stasis][stasis]]から生成されています。
stasisはClojureの静的ブログ生成ライブラリで、主張がほとんどない薄いフレームワークです。

descriptionには「Some Clojure functions for creating static websites.」とあります。
その説明通り、提供されているのは単なる関数なので、それを自分で組み合わせてオレオレフレームワークを作ろうぜという世界観です。

ソースは[[https://github.com/conao3/blog-stasis-src][conao3/blog-stasis-src]]においてあります。
ひとまずこんなところで。
